export const BEST_MATCH: Record<string, string[]> = {
  '牡羊座': ['獅子座', '射手座', '水瓶座'],
  '牡牛座': ['蟹座', '乙女座', '山羊座'],
  '双子座': ['天秤座', '水瓶座', '獅子座'],
  '蟹座': ['蠍座', '魚座', '牡牛座'],
  '獅子座': ['牡羊座', '射手座', '双子座'],
  '乙女座': ['牡牛座', '山羊座', '蟹座'],
  '天秤座': ['双子座', '水瓶座', '射手座'],
  '蠍座': ['蟹座', '魚座', '乙女座'],
  '射手座': ['牡羊座', '獅子座', '天秤座'],
  '山羊座': ['牡牛座', '乙女座', '魚座'],
  '水瓶座': ['双子座', '天秤座', '牡羊座'],
  '魚座': ['蟹座', '蠍座', '山羊座'],
};

export const SOULMATE: Record<string, string> = {
  '牡羊座': '天秤座',
  '牡牛座': '蠍座',
  '双子座': '射手座',
  '蟹座': '山羊座',
  '獅子座': '水瓶座',
  '乙女座': '魚座',
  '天秤座': '牡羊座',
  '蠍座': '牡牛座',
  '射手座': '双子座',
  '山羊座': '蟹座',
  '水瓶座': '獅子座',
  '魚座': '乙女座',
};

export const LUCKY_COLORS: Record<number, string> = {
  1: 'ルビーレッド',
  2: 'ムーンシルバー',
  3: 'サンゴールド',
  4: 'フォレストグリーン',
  5: 'ターコイズブルー',
  6: 'ローズピンク',
  7: 'ロイヤルパープル',
  8: 'ブロンズゴールド',
  9: 'オパールホワイト',
};
